---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ElementLockedParam
source: html/cff7022e-d5df-77f7-f439-4a65f4abf4cc.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ElementLockedParam Property

"Locked"

## Syntax (C#)
```csharp
public static ForgeTypeId ElementLockedParam { get; }
```